Revit 2026 API

# ExportLinetypeKey(ExportLinetypeKey) Constructor

---

Constructs a new copy of the input ExportLinetypeKey object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ExportLinetypeKey(
	ExportLinetypeKey other
)
```
```vb
Public Sub New (
	other As ExportLinetypeKey
)
```
```cpp
public:
ExportLinetypeKey(
	ExportLinetypeKey^ other
)
```
```fsharp
new :
        other : ExportLinetypeKey -> ExportLinetypeKey
```

#### Parameters

other ExportLinetypeKey

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportLinetypeKey Class

ExportLinetypeKey Overload

Autodesk.Revit.DB Namespace